starter-kit-python.org
#+TITLE: Starter Kit Python
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Starter kit Python

Support for the Python programming language.

** Check Dependencies

Determine whether required packages are installed. If not, use ELPA to
install them.
#+BEGIN_SRC emacs-lisp
  (dolist (package '(python-mode ipython))
    (unless (package-installed-p package)
      (package-install package)))
#+END_SRC

** Use Python's python-mode.el instead of Emacs' python.el
   :PROPERTIES:
   :CUSTOM_ID: python
   :END:
Replace the Python mode that comes with Emacs by the Python mode
supplied by the Python distribution itself.
#+BEGIN_SRC emacs-lisp
(require 'python-mode)
(add-to-list 'auto-mode-alist '("\\.py\\'" . python-mode))
(add-to-list 'interpreter-mode-alist '("python" . python-mode))
#+END_SRC

** Use IPython if =ipython= command is present
   :PROPERTIES:
   :CUSTOM_ID: ipython
   :END:
If an =ipython= executable is on the path, then assume that IPython is
the preferred method python evaluation.
#+BEGIN_SRC emacs-lisp
  (when (executable-find "ipython")
    (require 'ipython)
    (setq org-babel-python-mode 'python-mode))
#+END_SRC

** Use Cython mode
   :PROPERTIES:
   :CUSTOM_ID: cython
   :END:
#+BEGIN_SRC emacs-lisp
(require 'cython-mode)
(add-to-list 'auto-mode-alist '("\\.pyx\\'" . cython-mode))
(add-to-list 'auto-mode-alist '("\\.pxd\\'" . cython-mode))
(add-to-list 'auto-mode-alist '("\\.pxi\\'" . cython-mode))
#+END_SRC
