starter-kit-python.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Python</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Starter Kit Python"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19T14:27+0200"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="stylesheets/styles.css">
             <link rel="stylesheet" href="stylesheets/org-pygments.css">

</head>
<body>

<div id="preamble">
<span><a title="home page" class="" href="http://xgarrido.dyndns.org/">home</a></span>
                     <span><a title="about" class="" href="http://xgarrido.dyndns.org/">about</a></span>
                     <span><a title="publication" class="" href="http://xgarrido.dyndns.org/">publication</a></span>
                     <span><a title="vitae" class="" href="http://xgarrido.dyndns.org/">vitae</a></span>
                     <span><a title="categories" class="" href="http://xgarrido.dyndns.org/">categories</a></span>
                     <span><a title="links" class="" href="http://xgarrido.dyndns.org/">links</a></span>
                     <span><a title="subscribe by RSS" class="" href="http://xgarrido.dyndns.org/">subscribe</a></span>
                     
</div>

<div id="content">
<h1 class="title">Starter Kit Python</h1>

<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter kit Python</h2>
<div class="outline-text-2" id="text-1">


<p>
Support for the Python programming language.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Check Dependencies</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Determine whether required packages are installed. If not, use ELPA to
install them.
</p>


<pre class="src src-emacs-lisp">(<span class="org-keyword">dolist</span> (package '(python-mode ipython))
  (<span class="org-keyword">unless</span> (package-installed-p package)
    (package-install package)))
</pre>


</div>

</div>

<div id="outline-container-python" class="outline-3">
<h3 id="python"><a name="sec-1-2" id="sec-1-2"></a>Use Python's python-mode.el instead of Emacs' python.el</h3>
<div class="outline-text-3" id="text-python">

<p>Replace the Python mode that comes with Emacs by the Python mode
supplied by the Python distribution itself.
</p>


<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">python-mode</span>)
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.py\\'"</span> . python-mode))
(add-to-list 'interpreter-mode-alist '(<span class="org-string">"python"</span> . python-mode))
</pre>


</div>

</div>

<div id="outline-container-ipython" class="outline-3">
<h3 id="ipython"><a name="sec-1-3" id="sec-1-3"></a>Use IPython if <code>ipython</code> command is present</h3>
<div class="outline-text-3" id="text-ipython">

<p>If an <code>ipython</code> executable is on the path, then assume that IPython is
the preferred method python evaluation.
</p>


<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (executable-find <span class="org-string">"ipython"</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ipython</span>)
  (setq org-babel-python-mode 'python-mode))
</pre>


</div>

</div>

<div id="outline-container-cython" class="outline-3">
<h3 id="cython"><a name="sec-1-4" id="sec-1-4"></a>Use Cython mode</h3>
<div class="outline-text-3" id="text-cython">




<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">cython-mode</span>)
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.pyx\\'"</span> . cython-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.pxd\\'"</span> . cython-mode))
(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.pxi\\'"</span> . cython-mode))
</pre>

</div>
</div>
</div>
</div>

</body>
</html>
